app/controllers/user_controller.rb

INSERT INTO "accounts" ("username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "gsdfsdfsdfsdfsdfsdfds"], ["password", "ffffffff"], ["created_at", "2021-06-21 22:19:08.048575"], ["updated_at", "2021-06-21 22:19:08.048575"]]
INSERT INTO "accounts" ("username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "sdsdfdsf"], ["password", "aaaaaaaa"], ["created_at", "2021-06-21 22:01:04.397121"], ["updated_at", "2021-06-21 22:01:04.397121"]]
---
        def signup
                @account_new  = Account.new
                @password_error =nil
                @user_name = params[:u_name]
                @password = params[:pass]
                @repassword = params[:repass]
                @email = params[:email]
                @message = nil
                if((@password === @repassword) && !(@password.nil?)) #password math
                        @account_new.username = @user_name
                        @account_new.password = @password
                        @account_new.save
                        if(@account_new.save)#Signup complete go to login page

INSERT INTO "iot_data" ("temp", "hum", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["temp", "20.01"], ["hum", "NIL"], ["created_at", "2021-07-13 17:05:33.809330"], ["updated_at", "2021-07-13 17:05:33.809330"]]
---
        def espDataCollection
                @temp = params[:temp]
                @iot_database  = IotDatum.new
                @iot_database.temp = @temp
                @iot_database.hum = "NIL"
                @iot_database.save